Repository: BachynskyiBohdan/Vocabulary
Catalog: Vocabulary/Vocabulary.Web/App_LocalResources/GlobalRes.*.resx
Languages: ru, uk

source: Add all To Vocabulary
ru: Добавить все к словарю
uk: Додати всі до словника

source: Add new
ru: Добавить
uk: Додати

# AddPhraseAsLearned
source: Add as learned
ru: Добавить как выученую
uk: Додати як вивчену

# AddPhraseAsLearnedTitle
source: Add phrase to vocabulary as learned
ru: Добавить фразу в словарь как выученую
uk: Додати фразу до словника як вивчену

# AddPhraseAsUnknown
source: Add as unknown
ru: Добавить как неизвесную
uk: Додати як невідому

# AddPhraseAsUnknownTitle
source: Add phrase to vocabulary as unknown
ru: Добавить фразу в словарь как неизвесную
uk: Додати фразу до словника як невідому

source: Add phrase to vocabulary
ru: Добавить фразу в словарь
uk: Добавити фразу до словника

# AdminGlossariesTitle
source: Glossaries main page
ru: Главная страница глоссариев
uk: Головна сторінка глосаріїв

source: All
ru: Все
uk: Всі

source: Already added to vocabulary
ru: Уже добавлено в словарь
uk: Вже додано до словника

source: Audio
ru: Аудио
uk: Аудіо

# AutoplayTitle
source: enable/disable autoplay
ru: включить/выключить автовоспроизведение
uk: ввімкнути/вимкнути автовідтворення

# ChangeVidgetSize
source: Change size of widget(with or without examples)
ru: Изменить размер виджета(с или без примеров)
uk: Змінити розмір віджету(з чи без прикладів)

source: Choose translation language:
ru: Выбрать язык перевода:
uk: Вибрати мову перекладу:

# EmailAlreadyExist
source: Email is already exist
ru: Указанный электронный адресс уже существует
uk: Вказана электронна скринька вже існує

# EmailParameterError
source: Email should contain only latin letters and numbers.
ru: Электронный адресс должнен содержать только литеры и цифры.
uk: Електронна скринька повинна містити тільки літери і цифри.

source: Examples
ru: Примеры
uk: Приклади

# ExistUsernameError
source: User with such username isn't exist
ru: Пользователь с таким именем не существует
uk: Користувача із указаним ім'ям не існує

source: Glossaries
ru: Глосарии
uk: Глосарії

source: Glossary -
ru: Глоссарий -
uk: Глосарій -

source: Learning state
ru: Состояние обучения
uk: Стан вивчення

source: Loading...
ru: Загрузка...
uk: Завантаження...

source: Logo
ru: Лого
uk: Лого

source: Open glossary
ru: Открыть глоссарий
uk: Відкрити глосарій

source: out of
ru: из
uk: із

# PasswordParameterError
source: Pasword should contain only latin letters and numbers. Minimum 6, maximum 16 symbols.
ru: Пароль должен содержать только литеры, цифры. Минимум 6, максимум 16 символов.
uk: Пароль повинен містити тільки літери і цифри. Мінімум 6, максимум 16 символів.

source: Phrase
ru: Фраза
uk: Фраза

source: Phrases
ru: Фразы
uk: Фрази

# PhrasesTitle
source: Phrases main page
ru: Главная страница фраз
uk: Головна сторінка фраз

source: Play audio
ru: Воспроизвести аудио
uk: Відтворити аудіо

source: Registration
ru: Регистрация
uk: Реєстрація

source: Remove phrase from vocabulary
ru: Удалить фразу со словаря
uk: Видалити фразу с словника

# RemovePhrasesFromVocabulary
source: Remove selected phrases from vocabulary
ru: Удалить выбранные фразы со словаря
uk: Видалити вибрани фрази з словника

# SearchPlaceholder
source: Search query...
ru: Поисковый запрос...
uk: Пошуковий запит...

# SelectedGlossaryLanguage
source: Selected glossaries language
ru: Выбранный язык глоссариев
uk: Вибрана мова глосаріїв

# SelectedTranslationLanguage
source: Selected phrases translations language
ru: Выбранный язык перевода фраз
uk: Вибрана мова перекладу фраз

# SelectGlossaryEnLanguage
source: Select glossaries in english language
ru: Выбрать английским язык глоссариев
uk: Вибрати англійською мову глосаріїв

# SelectGlossaryRuLanguage
source: Select glossaries in russian language
ru: Выбрать русским язык глоссариев
uk: Вибрати російською мову глосаріїв

# SelectGlossaryUkLanguage
source: Select glossaries in ukrainian language
ru: Выбрать украинским язык глоссариев
uk: Вибрати українською мову глосаріїв

# SelectTranslationEnLanguage
source: Select phrases translations in english language
ru: Выбрать английским язык перевода фраз
uk: Вибрати англійською мову перекладу фраз

# SelectTranslationRuLanguage
source: Select phrases translations in russian language
ru: Выбрать русским язык перевода фраз
uk: Вибрати російською мову перекладу фраз

# SelectTranslationUkLanguage
source: Select phrases translations in ukrainian language
ru: Выбрать украинским язык перевода фраз
uk: Вибрати українською мову перекладу фраз

# Sentence
source: Sentences
ru: Предложения
uk: Речення

source: Sign in
ru: Ввойти
uk: Ввійти

# SignInAs
source: Hello,
ru: Привет,
uk: Привіт,

source: Sign out
ru: Выйти
uk: Вийти

# SomethingWrong
source: Something is going wrong!
ru: Что-то пошло не так
uk: Щось пішло не так

source: Translation
ru: Перевод
uk: Переклад

# UserGlossariesTitle
source: Phrases sets
ru: Наборы фраз
uk: Набори фраз

# UsernameAlreadyExist
source: Username is already exist
ru: Указанное имя уже существует
uk: Вказане ім'я вже існує

# UsernameOrPasswordIncorrent
source: Username or password is incorrect
ru: Имя или пароль неверны
uk: Ім'я чи пароль невірні

# UsernameParameterError
source: Username should contain only latin letters and numbers and begin with a letter. Minimum 5, maximum 30 symbols.
ru: Имя должно содержать только латинские литеры и цифры и начинаться с литеры. Минимум 5, максимум 30 символов.
uk: Ім'я повинно містити тільки латинські літери та цифри і починатися з літери. Мінімум 5, максимум 30 символів.

source: Vocabulary
ru: Словарь
uk: Словник

# VocabularyTitle
source: User Vocabulary
ru: Словарь пользователя
uk: Словник користувача

# Word
source: Words
ru: Слова
uk: Слова

source: Word rank
ru: Ранк слова
uk: Ранг слова

source: words
ru: слов
uk: слів

source: Begin
ru: Начало
uk: Початок

source: End
ru: Конец
uk: Кінець

source: Next page
ru: Следующая страница
uk: Наступна сторінка

# PrevPage
source: Previous page
ru: Предыдущая страница
uk: Попередня сторінка

source: Email
ru: Электронный адресс

# Enter
source: Sign in
ru: Вход

source: Password
ru: Пароль

source: Quick registration
ru: Быстрая регистрация

source: Register
ru: Зарегистрироваться

source: Username
ru: Логин

source: Username or email
ru: Логин или электронный адресс
